from aiogram.types import InlineKeyboardMarkup, InlineKeyboardButton


class OldUserView:

    async def __call__(self):
        text = (
            "👋 **Добро пожаловать обратно!**\n\n"
            "Рады видеть тебя снова в нашем боте! 🎉\n\n"
            "✨ **Что ты можешь сделать здесь:**\n"
            "- 📂 **Создавай и обновляй** своё IT-портфолио\n"
            "- 🚀 **Делись** своими проектами с сообществом\n"
            "- 🔍 **Просматривай** работы других пользователей\n"
            "Не забывай регулярно обновлять своё портфолио, чтобы всегда быть на шаг впереди! 💼💡\n\n"
            "Если у тебя есть вопросы или нужна помощь, напиши нам! 📩"
        )
        keyboard = InlineKeyboardMarkup(
            inline_keyboard=[
                [
                    InlineKeyboardButton(text="Мои портфолио", callback_data="see_all_portfolio")
                ]
            ]
        )
        return text, keyboard